Repository: wangchong2023/ZhiYu
Catalog: Sources/Localization/Catalogs/AI.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# prompt.jailbreakError
source: Detected potential prompt jailbreak injection attack: %@
zh_hans: 检测到潜在的提示词越狱注入攻击: %@

# prompt.followUpHeader
source: If you'd like to explore this topic further, recommended next steps include:
zh_hans: 如果你对当前话题比较深入，接下来比较值得了解的是：

# ai.status.analyzing
source: Analyzing content...
zh_hans: 正在分析内容...
zh_hant: 正在分析內容...

# ai.status.digging
source: Digging into background knowledge...
zh_hans: 正在深挖背景知识...
zh_hant: 正在深挖背景知識...

# ai.status.extracting
source: Extracting core concepts...
zh_hans: 正在提炼核心概念...
zh_hant: 正在提炼核心概念...

# ai.status.generating
source: Generating insights...
zh_hans: 正在生成洞察...
zh_hant: 正在生成洞察...

# ai.status.indexing
source: Indexing (%lld/%lld): %@
zh_hans: 正在索引 (%lld/%lld): %@
zh_hant: 正在索引 (%lld/%lld): %@

# ai.status.organizing
source: Organizing presentation outline...
zh_hans: 正在编排演示大纲...
zh_hant: 正在编排演示大纲...

# ai.status.preprocessing
source: Preprocessing chunks...
zh_hans: 正在预处理分块...
zh_hant: 正在預處理分塊...

# ai.status.scanning
source: Intelligent Scanning...
zh_hans: 全库智能扫描中...
zh_hant: 全庫智能掃描中...

# ai.status.structuring
source: Building logical topology...
zh_hans: 正在构建逻辑拓扑...
zh_hant: 正在構建逻辑拓撲...

# ai.status.synthesizing
source: Synthesizing cross-domain insights...
zh_hans: 正在合成跨领域洞察...
zh_hant: 正在合成跨領域洞察...

# ai.status.skeleton.thinking
source: AI IS THINKING...
zh_hans: AI 正在思考...
zh_hant: AI 正在思考...

# ai.status.skeleton.embedding
source: INITIALIZING NEURAL WEIGHTS...
zh_hans: 正在初始化神经网络权重...
zh_hant: 正在初始化神經網路權重...

# ai.status.skeleton.retrieval
source: SCANNING LOCAL KNOWLEDGE...
zh_hans: 正在扫描本地知识库...
zh_hant: 正在掃描本地知識庫...

# ai.status.skeleton.synthesis
source: SYNTHESIZING CONCEPTS...
zh_hans: 正在合成核心概念...
zh_hant: 正在合成核心概念...

# ai.status.visualizing
source: Visualizing semantic connections...
zh_hans: 正在可视化语义联系...
zh_hant: 正在可視化語义联係...

# chat.copied
source: Copied to Clipboard
zh_hans: 已复制到剪切板
zh_hant: 已複製到剪下板

# aitask.categories
source: Categories
zh_hans: 任务分类
zh_hant: 任務分類

# aitask.center.title
source: Task Center
zh_hans: 任务中心
zh_hant: 任務中心

# aitask.clearConfirmMessage
source: This will clear all completed and failed task records. This action cannot be undone.
zh_hans: 此操作将清除所有已完成和失败的任务记录，不可恢复。
zh_hant: 此操作將清除所有已完成和失敗的任務記錄，不可恢複。

# aitask.clearConfirmTitle
source: Clear Task History
zh_hans: 清空任务历史
zh_hant: 清空任務历史

# aitask.empty.desc
source: Progress of all AI scans, synthesis, and health check tasks will be shown here.
zh_hans: 所有 AI 扫描、导出合成和健康检查任务的进度都将在这里显示。
zh_hant: 所有 AI 掃描、匯出合成和健康检查任務的進度都將在這裏顯示。

# aitask.empty.title
source: No Active Tasks
zh_hans: 当前无活跃任务
zh_hant: 当前無活跃任務

# aitask.emptyHint
source: This shows long-running background tasks like synthesis, full-vault scanning, etc. You can start tasks from the Labs in page details.
zh_hans: 此处展示长耗时的异步后台任务，如知识合成、全库扫描等。您可以在页面详情的实验室栏中启动任务。
zh_hant: 此處展示長耗時的異步後臺任務，如知識合成、全庫掃描等。您可以在頁面詳情的實驗室欄中啟動任務。

# aitask.guide.aiscan
source: AI Scan
zh_hans: 智能扫描
zh_hant: 智能掃描

# aitask.guide.aiscan.desc
source: Click 'Deep Scan' in sidebar
zh_hans: 在侧边栏点击“深度扫描”
zh_hant: 在侧边欄点擊“深度掃描”

# aitask.guide.health
source: Health Check
zh_hans: 健康检查
zh_hant: 健康检查

# aitask.guide.health.desc
source: Click 'Health Check' in sidebar
zh_hans: 在侧边栏点击“健康检查”
zh_hant: 在侧边欄点擊“健康检查”

# aitask.guide.ingest
source: Knowledge Ingest
zh_hans: 知识导入
zh_hant: 知識匯入

# aitask.guide.ingest.desc
source: Add content from 'Ingest' page
zh_hans: 从“导入”页面添加新内容
zh_hant: 从“匯入”頁面添加新內容

# aitask.guide.synthesis
source: Knowledge Synthesis
zh_hans: 知识合成
zh_hant: 知識合成

# aitask.guide.synthesis.desc
source: Start export tasks in Synthesis Center
zh_hans: 在合成中心发起导出任务
zh_hant: 在合成中心發起匯出任務

# aitask.history.count
source: %lld executions
zh_hans: 累计执行 %lld 次
zh_hant: 累计執行 %lld 次

# aitask.howToTrigger
source: How to trigger tasks?
zh_hans: 如何触发任务？
zh_hant: 如何触發任務？

# aitask.list.title
source: Task Flow Details
zh_hans: 任务流详情
zh_hant: 任務流詳情

# aitask.noHistory
source: No task history
zh_hans: 暂无此类任务历史
zh_hant: 暫無此類任務历史

# aitask.noRunning
source: No active tasks
zh_hans: 暂无任务
zh_hant: 暫無任務

# aitask.processing
source: Processing...
zh_hans: 处理中...
zh_hant: 處理中...

# aitask.scanTaskName
source: Library Scan
zh_hans: 全库智能扫描
zh_hant: 全庫智能掃描

# aitask.status.completed
source: Completed
zh_hans: 已完成
zh_hant: 已完成

# aitask.status.failed
source: Failed
zh_hans: 已失败
zh_hant: 已失敗

# aitask.status.pending
source: Pending
zh_hans: 等待中
zh_hant: 等待中

# aitask.status.running
source: Running
zh_hans: 执行中
zh_hant: 執行中

# aitask.status.thinking
source: Thinking...
zh_hans: 正在思考...
zh_hant: 正在思考...

# aitask.tools
source: Synthesis Tools
zh_hans: 合成工具
zh_hant: 合成工具

# aitask.type.healthCheck
source: Health Check
zh_hans: 健康检查
zh_hant: 健康检查

# chat.aiAssistantName
source: ZhiYu Chat
zh_hans: 智宇对话
zh_hant: 智宇對話

# chat.clearHistory.confirm.message
source: This action will permanently delete all messages in the current conversation and cannot be undone.
zh_hans: 此操作将永久删除当前对话的所有消息记录，且不可撤销。
zh_hant: 此操作將永久刪除当前對話的所有消息記錄，且不可復原。

# chat.clearHistory.confirm.title
source: Clear Chat History?
zh_hans: 确认清空对话记录？
zh_hant: 確認清空對話記錄？

# chat.configureFirst
source: Please configure AI Model first
zh_hans: 请先配置大模型
zh_hant: 請先設定大模型

# chat.deepExplorePrompt
source: Explore: %@
zh_hans: 探索：%@
zh_hant: 探索：%@

# chat.explorationAndPrompts
source: Prompts
zh_hans: 提示词
zh_hant: 提示词

# chat.exportConversation
source: Export Conversation
zh_hans: 导出对话
zh_hant: 匯出對話

# chat.exportPDF
source: Export as PDF
zh_hans: 导出为 PDF
zh_hant: 匯出為 PDF

# chat.exportSelectedPDF
source: Export Selected PDF
zh_hans: 导出选中的 PDF
zh_hant: 匯出選中的 PDF

# chat.group.ai
source: AI Inspiration
zh_hans: AI 启发
zh_hant: AI 啟發

# chat.group.base
source: Explore
zh_hans: 探索
zh_hant: 探索

# chat.group.user
source: My Shortcuts
zh_hans: 我的指令
zh_hant: 我的指令

# chat.inputPlaceholder
source: Ask your knowledge base...
zh_hans: 问你的知识库...
zh_hant: 問你的知識庫...

# chat.llmSettings
source: Model Settings
zh_hans: 大模型设置
zh_hant: 大模型設定

# chat.referencesCollapsed
source: References
zh_hans: 引用来源
zh_hant: 引用來源

# chat.selectToExport
source: Select Messages
zh_hans: 选择聊天内容
zh_hant: 選擇聊天內容

# chat.welcomeDesc
source: Answer questions based on your knowledge, discover connections, find gaps
zh_hans: 基于你的知识库内容回答问题，发现关联，发现盲区
zh_hant: 基於你的知識庫內容回答問題，發現關联，發現盲區

# llm.apiAddress
source: API Address
zh_hans: API 地址
zh_hant: API 地址

# llm.apiKey
source: API Key
zh_hans: API 密钥
zh_hant: API 密钥

# llm.chatHistory
source: Chat History
zh_hans: 对话记录
zh_hant: 對話記錄

# llm.chatSection
source: Chat
zh_hans: 对话
zh_hant: 對話

# llm.clearHistory
source: Clear Chat History
zh_hans: 清空对话记录
zh_hant: 清空對話記錄

# llm.configuration
source: Configuration
zh_hans: 模型配置
zh_hant: 模型設定

# llm.connectionSuccess
source: Connection successful! API Key is valid
zh_hans: 连接成功！API Key 有效
zh_hant: 連線成功！API Key 有效

# llm.enableAssistant
source: Enable AI Assistant
zh_hans: 开启 AI 助手
zh_hant: 開啟 AI 助手

# llm.error
source: AI Model Service Error
zh_hans: 大模型服务错误
zh_hant: 大模型服務錯誤

# llm.error.apiError
source: API Error
zh_hans: API 错误
zh_hant: API 錯誤

# llm.error.cancelled
source: Request cancelled
zh_hans: 请求已取消
zh_hant: 請求已取消

# llm.error.httpError
source: HTTP Error
zh_hans: HTTP 错误
zh_hant: HTTP 錯誤

# llm.error.invalidResponse
source: Invalid API response format
zh_hans: API 返回格式异常
zh_hant: API 返回格式異常

# llm.error.invalidURL
source: Invalid API URL
zh_hans: API 地址无效
zh_hant: API 地址無效

# llm.error.notConfigured
source: AI Model is not configured. Please provide API Key in Settings.
zh_hans: 大模型未配置，请在设置中提供 API 密钥。
zh_hant: 大模型未設定，請在設定中提供 API 密钥。

# llm.error.rateLimited
source: Too many requests, please try again later
zh_hans: 请求过于频繁，请稍后重试
zh_hant: 請求過於頻繁，請稍後重試

# llm.error.unauthorized
source: API Key invalid or expired
zh_hans: API Key 无效或已过期
zh_hant: API Key 無效或已過期

# llm.eval.judgePrompt
source: You are a RAG system evaluation expert. Please score the AI's answer based on the following five dimensions (0.0 - 1.0): 1. Faithfulness: Is the answer based entirely on the provided context? Are there hallucinations? 2. Relevance: Does the answer directly and completely solve the user's question? 3. Context Precision: Does the provided context really contain the knowledge needed to answer the question? 4. Hallucination Rate: What proportion of the answer contains claims NOT supported by the context? (0.0 = perfect, 1.0 = entirely fabricated) 5. Citation Accuracy: How accurately do the citations point to the correct source content? (1.0 = perfectly accurate) Context: %1$@ Query: %2$@ Answer: %3$@ Please return the score strictly in the following JSON format: { "faithfulness": 0.9, "relevance": 0.8, "precision": 0.9, "hallucination_rate": 0.1, "citation_accuracy": 0.85, "reasoning": "Brief explanation of the reason" }
zh_hans: 你是一个 RAG 系统评估专家。请根据以下五个维度对 AI 的回答进行评分 (0.0 - 1.0)： 1. Faithfulness (忠实度): 回答是否完全基于提供的上下文？是否有幻觉？ 2. Relevance (相关度): 回答是否直接且完整地解决了用户的问题？ 3. Context Precision (上下文精确度): 提供的上下文是否真的包含回答问题所需的知识？ 4. Hallucination Rate (幻觉率): 回答中有多大比例的内容是上下文无法支撑的？(0.0 = 完美无幻觉, 1.0 = 完全编造) 5. Citation Accuracy (引用准确度): 引用是否准确指向了原文对应位置？(1.0 = 完全准确) Context: %1$@ Query: %2$@ Answer: %3$@ Please return the score strictly in the following JSON format: { "faithfulness": 0.9, "relevance": 0.8, "precision": 0.9, "hallucination_rate": 0.1, "citation_accuracy": 0.85, "reasoning": "简要说明理由" }
zh_hant: 你是一個 RAG 係統評估專家。請根據以下五個維度對 AI 的回答進行評分 (0.0 - 1.0)： 1. Faithfulness (忠實度): 回答是否完全基於提供的上下文？是否有幻覺？ 2. Relevance (相關度): 回答是否直接且完整地解決了使用者的問題？ 3. Context Precision (上下文精確度): 提供的上下文是否真的包含回答問題所需的知識？ 4. Hallucination Rate (幻覺率): 回答中有多大比例的內容是上下文無法支撑的？(0.0 = 完美無幻覺, 1.0 = 完全编造) 5. Citation Accuracy (引用準確度): 引用是否準確指向了原文對應位置？(1.0 = 完全準確) Context: %1$@ Query: %2$@ Answer: %3$@ Please return the score strictly in the following JSON format: { "faithfulness": 0.9, "relevance": 0.8, "precision": 0.9, "hallucination_rate": 0.1, "citation_accuracy": 0.85, "reasoning": "简要說明理由" }

# llm.eval.status.error
source: Error
zh_hans: 评估出错
zh_hant: 評估出错

# llm.eval.status.fail
source: Fail
zh_hans: 评估未通过
zh_hant: 評估未通過

# llm.eval.status.pass
source: Pass
zh_hans: 评估通过
zh_hant: 評估通過

# llm.eval.status.warning
source: Warning
zh_hans: 评估警告
zh_hant: 評估警告

# llm.eval.systemPrompt
source: You are a RAG system evaluation expert (LLM-as-a-Judge).
zh_hans: 你是一个 RAG 系统评估专家 (LLM-as-a-Judge)。
zh_hant: 你是一個 RAG 係統評估專家 (LLM-as-a-Judge)。

# llm.info
source: Info
zh_hans: 说明
zh_hant: 說明

# llm.info.contextSent
source: Only current page content and metadata are sent to LLM.
zh_hans: 只有当前页面内容及相关元数据会被发送给 LLM。
zh_hant: 隻有当前頁面內容及相關元資料會被發送給 LLM。

# llm.info.localKey
source: Your API key is only stored locally and encrypted.
zh_hans: 您的 API 密钥仅在本地加密存储，绝不会上传到第三方服务器。
zh_hant: 您的 API 密钥仅在本地加密存储，絕不會上傳到第三方伺服器。

# llm.info.openAICompatible
source: Supports all OpenAI-compatible providers.
zh_hans: 支持所有兼容 OpenAI API 规范的提供商。
zh_hant: 支援所有兼容 OpenAI API 規範的提供商。

# llm.info.smartIngest
source: If enabled, LLM will optimize knowledge during ingest.
zh_hans: 开启后，导入知识时将自动使用 LLM 进行优化。
zh_hant: 開啟後，匯入知識時將自動使用 LLM 進行最佳化。

# llm.ingest.compileInstruction
source: Please compile the following raw material into a structured Knowledge page.
zh_hans: 请将以下素材加工为结构化的知识库内容。
zh_hant: 請將以下素材加工為結構化的知識庫內容。

# llm.ingest.compileRules
source: Compilation rules:
zh_hans: 萃取规则：
zh_hant: 萃取規則：

# llm.ingest.enrichSystemPrompt
source: You are a professional knowledge extraction expert.
zh_hans: 你是一个专业的知识提取专家。
zh_hant: 你是一個專業的知識提取專家。

# llm.ingest.existingPages
source: Existing Knowledge pages (link these preferentially)
zh_hans: 已有知识库页面（请优先链接这些）
zh_hant: 已有知識庫頁面（請優先链接這些）

# llm.ingest.jsonCompiledContent
source: Compiled Markdown content
zh_hans: 加工后的 Markdown 内容
zh_hant: 加工後的 Markdown 內容

# llm.ingest.jsonFormat
source: Return the compiled result in JSON format:
zh_hans: 请以 JSON 格式返回加工结果：
zh_hant: 請以 JSON 格式返回加工結果：

# llm.ingest.jsonSuggestedTags
source: tags
zh_hans: 标签
zh_hant: 標籤

# llm.ingest.jsonSummary
source: A brief summary
zh_hans: 一段简短摘要
zh_hant: 一段简短摘要

# llm.ingest.rawContent
source: Raw material content:
zh_hans: 原始资料内容：
zh_hant: 原始資料內容：

# llm.ingest.rawTitle
source: Raw material title
zh_hans: 原始资料标题
zh_hant: 原始資料標題

# llm.ingest.rule1
source: 1. Use Markdown format
zh_hans: 1. 使用 Markdown 格式
zh_hant: 1. 使用 Markdown 格式

# llm.ingest.rule2
source: 2. Link to existing Knowledge pages using [[Page Title]] syntax if content mentions related concepts
zh_hans: 2. 用 [[页面标题]] 语法链接到已有的知识库页面（如果内容提及了相关概念）
zh_hant: 2. 用 [[頁面標題]] 語法链接到已有的知識庫頁面（如果內容提及了相關概念）

# llm.ingest.rule3
source: 3. Extract key concepts as tags
zh_hans: 3. 提取关键概念作为标签
zh_hant: 3. 提取關鍵概念作為標籤

# llm.ingest.rule4
source: 4. Organize content into clear sections
zh_hans: 4. 组织内容为清晰的章节结构
zh_hant: 4. 組織內容為清晰的章節結構

# llm.ingest.rule5
source: 5. Use tables for comparisons or relationships
zh_hans: 5. 如果内容涉及对比或关联，使用表格呈现
zh_hant: 5. 如果內容涉及對比或關联，使用表格呈現

# llm.ingest.rule6
source: 6. Keep facts accurate, do not add information not in the original
zh_hans: 6. 保持事实准确，不添加原文没有的信息
zh_hant: 6. 保持事實準確，不添加原文沒有的資訊

# llm.ingest.systemPrompt
source: You are a ZhiYu compiler. Compile raw material into structured content. Return only JSON, no other text.
zh_hans: 你是知识库的萃取专家。将原始素材加工为结构化的知识库内容。只返回 JSON，不要包含其他文本。
zh_hant: 你是知識庫的萃取專家。將原始素材加工為結構化的知識庫內容。隻返回 JSON，不要包含其他文本。

# llm.messages
source: messages
zh_hans: 条消息
zh_hant: 條消息

# llm.model
source: Model Name
zh_hans: 模型名称
zh_hant: 模型名稱

# llm.prompt.chunkType
source: Chunk Type
zh_hans: 分块类型
zh_hant: 分塊類型

# llm.prompt.conceptCount
source: concepts
zh_hans: 概念
zh_hant: 概念

# llm.prompt.conceptList
source: Concept list:
zh_hans: 概念列表：
zh_hant: 概念清單：

# llm.prompt.duty1
source: 1. Answer questions about the knowledge base content
zh_hans: 1. 回答用户关于知识库内容的问题
zh_hant: 1. 回答使用者關於知識庫內容的問題

# llm.prompt.duty2
source: 2. Help organize and compile knowledge
zh_hans: 2. 帮助整理和加工知识
zh_hant: 2. 說明整理和加工知識

# llm.prompt.duty3
source: 3. Suggest connections between pages
zh_hans: 3. 建议页面间的关联
zh_hant: 3. 建議頁面間的關联

# llm.prompt.duty4
source: 4. Discover knowledge gaps and contradictions
zh_hans: 4. 发现知识盲区和矛盾
zh_hant: 4. 發現知識盲區和矛盾

# llm.prompt.entityCount
source: entities
zh_hans: 实体
zh_hant: 實體

# llm.prompt.entityList
source: Entity list:
zh_hans: 实体列表：
zh_hant: 實體清單：

# llm.prompt.issueDesc
source: Issue Description
zh_hans: 问题描述
zh_hant: 問題描述

# llm.prompt.issueType
source: Issue Type
zh_hans: 问题类型
zh_hant: 問題類型

# llm.prompt.otherPageTitles
source: Other Page Titles in Vault
zh_hans: 知识库中的其他页面标题
zh_hant: 知識庫中的其他頁面標題

# llm.prompt.overview
source: Current knowledge base overview:
zh_hans: 当前知识库概览：
zh_hant: 当前知識庫概覽：

# llm.prompt.pageContentSnippet
source: Current Page Content Snippet
zh_hans: 当前页面部分内容
zh_hant: 当前頁面部分內容

# llm.prompt.recentUpdates
source: Recent updates:
zh_hans: 最近更新：
zh_hant: 最近更新：

# llm.prompt.relevanceScore
source: Relevance Score
zh_hans: 相关度评分
zh_hant: 相關度評分

# llm.prompt.relevantPages
source: Relevant page content:
zh_hans: 相关页面内容：
zh_hant: 相關頁面內容：

# llm.prompt.role
source: You are a ZhiYu assistant, running on classic Personal Knowledge Management methodology.
zh_hans: 你是知识库助手，基于经典个人知识管理方法论运行。
zh_hant: 你是知識庫助手，基於經典個人知識管理方法論運行。

# llm.prompt.rule1
source: - Answer based on knowledge base facts, cite related pages using [[Page Title]] format
zh_hans: - 基于知识库事实回答，引用相关页面用 [[页面标题]] 格式
zh_hant: - 基於知識庫事實回答，引用相關頁面用 [[頁面標題]] 格式

# llm.prompt.rule2
source: - If the knowledge base has no relevant information, state clearly
zh_hans: - 如果知识库中没有相关信息，明确说明
zh_hant: - 如果知識庫中沒有相關資訊，明確說明

# llm.prompt.rule3
source: - Respond in the user's language
zh_hans: - 回答使用中文
zh_hant: - 回答使用中文

# llm.prompt.rule4
source: - Keep answers concise, accurate, and well-organized
zh_hans: - 保持简洁、准确、有条理
zh_hant: - 保持简潔、準確、有條理

# llm.prompt.sourceCount
source: sources
zh_hans: 来源
zh_hant: 來源

# llm.prompt.sourceList
source: Source list:
zh_hans: 来源列表：
zh_hant: 來源清單：

# llm.prompt.statusLabel
source: Status
zh_hans: 状态
zh_hant: 狀態

# llm.prompt.totalPages
source: - Total pages
zh_hans: - 总页面
zh_hant: - 總頁面

# llm.providerConfig
source: Provider Configuration
zh_hans: 模型提供商配置
zh_hant: 模型提供商設定

# llm.serviceStatus
source: Service Status
zh_hans: 服务状态
zh_hant: 服務狀態

# llm.provider
source: Provider
zh_hans: 提供商
zh_hant: 提供商

# llm.provider.custom
source: Custom API
zh_hans: 自定义 API
zh_hant: 自訂 API

# llm.provider.kimi
source: Kimi (Moonshot)
zh_hans: Kimi (月之暗面)
zh_hant: Kimi (月之暗面)

# llm.provider.qwen
source: Tongyi Qwen
zh_hans: 通义千问
zh_hant: 通义千問

# llm.provider.siliconflow
source: SiliconFlow
zh_hans: 硅基流动
zh_hant: 硅基流動

# llm.provider.zhipu
source: Zhipu GLM
zh_hans: 智谱 GLM
zh_hant: 智譜 GLM

# llm.testConnection
source: Test Connection
zh_hans: 测试连接
zh_hant: 测試連線

# llm.testing
source: Testing...
zh_hans: 正在测试...
zh_hant: 正在测試...

# llm.title
source: Online LLMs
zh_hans: 在线大模型
zh_hant: 線上大模型

# llm.validation
source: Connectivity Validation
zh_hans: 连通性校验
zh_hant: 連通性校驗

# llm.validationFailed
source: Test Failed
zh_hans: 测试失败
zh_hant: 测試失敗

# llm.latency
source: Latency: %@
zh_hans: 时延：%@
zh_hant: 時延：%@

# ondevice.appleIntelligence
source: Apple Intelligence
zh_hans: Apple 智能
zh_hant: Apple 智能

# ondevice.assistDesc
source: AI runs silently in background to provide instant insights and refactor tips.
zh_hans: 开启后，AI 将在后台静默运行，为您提供即时的知识发现和重构建议。
zh_hant: 開啟後，AI 將在後臺静默運行，為您提供即時的知識發現和重構建議。

# ondevice.assistMode
source: Collaborative AI (Shadow Mode)
zh_hans: 协作式 AI (影子模式)
zh_hant: 協作式 AI (影子模式)

# ondevice.autoRefactor
source: Auto Refactor Suggestions
zh_hans: 自动生成重构建议
zh_hant: 自動生成重構建議

# ondevice.available
source: On-device inference available
zh_hans: 端侧推理可用
zh_hant: 端侧推理可用

# ondevice.chatContext
source: You are a ZhiYu assistant. Answer based on the following content.
zh_hans: 你是知识库助手。基于以下知识库内容回答问题。
zh_hant: 你是知識庫助手。基於以下知識庫內容回答問題。

# ondevice.chatQuestion
source: Question
zh_hans: 问题
zh_hant: 問題

# ondevice.connected
source: Connected
zh_hans: 连接成功
zh_hant: 連線成功

# ondevice.enableAutoScan
source: Auto Scan Vault
zh_hans: 自动扫描知识库
zh_hant: 自動掃描知識庫

# ondevice.error.compilationFailed
source: Model compilation failed
zh_hans: 知识萃取失败
zh_hant: 知識萃取失敗

# ondevice.error.inferenceFailed
source: Inference failed
zh_hans: 推理失败
zh_hant: 推理失敗

# ondevice.error.loadFailed
source: Load Failed
zh_hans: 加载失败
zh_hant: 加載失敗

# ondevice.error.modelNotFound
source: Model not found
zh_hans: 模型未找到
zh_hant: 模型未找到

# ondevice.error.modelNotLoaded
source: Model not loaded
zh_hans: 模型未加载
zh_hant: 模型未加載

# ondevice.error.notSupported
source: Not supported on this system
zh_hans: 当前系统不支持
zh_hant: 当前係統不支援

# ondevice.generate
source: Generate
zh_hans: 生成
zh_hant: 生成

# ondevice.generating
source: Generating...
zh_hans: 生成中...
zh_hant: 生成中...

# ondevice.importModel
source: Import Model
zh_hans: 导入模型
zh_hant: 匯入模型

# ondevice.inferenceSpeed
source: Inference Speed
zh_hans: 推理速度
zh_hant: 推理速度

# ondevice.info.memory
source: Models use device memory — large models may affect performance
zh_hans: 模型使用设备内存，大模型可能影响性能
zh_hant: 模型使用設備記憶體，大模型可能影響性能

# ondevice.info.ne
source: Uses Neural Engine for accelerated inference
zh_hans: 利用 Neural Engine 加速推理
zh_hant: 利用 Neural Engine 加速推理

# ondevice.info.offline
source: No network required — fully offline
zh_hans: 无需网络连接，完全离线运行
zh_hant: 無需網路連線，完全離線運行

# ondevice.info.privacy
source: All inference runs locally — data never leaves your device
zh_hans: 所有推理在设备本地完成，数据不离开设备
zh_hant: 所有推理在設備本地完成，資料不離開設備

# ondevice.ingest.compileToKnowledge
source: Compile the following content into a structured ZhiYu page. Existing pages
zh_hans: 将以下内容加工为结构化知识库页面。已有页面
zh_hant: 將以下內容加工為結構化知識庫頁面。已有頁面

# ondevice.ingest.title
source: Title
zh_hans: 标题
zh_hant: 標題

# ondevice.ingest.content
source: Content
zh_hans: 内容
zh_hant: 內容

# ondevice.ingest.linkAndFormat
source: Link existing pages with [[Page Title]]. Output in Markdown format.
zh_hans: 用 [[页面标题]] 链接已有页面。输出 Markdown 格式。
zh_hant: 用 [[頁面標題]] 链接已有頁面。輸出 Markdown 格式。

# ondevice.loadModel
source: Load Model
zh_hans: 加载模型
zh_hant: 加載模型

# ondevice.local
source: Local
zh_hans: 本地
zh_hant: 本地

# ondevice.model.bundled
source: ZhiYu LLM (Bundled)
zh_hans: 知识库 LLM（内置）
zh_hant: 知識庫 LLM（內置）

# ondevice.modelLoaded
source: Model loaded
zh_hans: 模型已加载
zh_hant: 模型已加載

# ondevice.models
source: Available Models
zh_hans: 可用模型
zh_hant: 可用模型

# ondevice.noModels
source: No local models available. Import a .mlmodelc file.
zh_hans: 没有可用的本地模型。请导入 .mlmodelc 模型文件。
zh_hant: 沒有可用的本地模型。請匯入 .mlmodelc 模型檔案。

# ondevice.requiresIOS17
source: Requires iOS 17.0 or later
zh_hans: 需要 iOS 17.0 或更高版本
zh_hant: 需要 iOS 17.0 或更高版本

# ondevice.result
source: Result
zh_hans: 生成结果
zh_hant: 生成結果

# ondevice.subtitle
source: Run LLM locally — no network needed, fully private
zh_hans: 在设备本地运行 LLM，无需网络，完全私密
zh_hant: 在設備本地運行 LLM，無需網路，完全私密

# ondevice.supportsCoreML
source: Supports Core ML model inference
zh_hans: 支持 Core ML 模型推理
zh_hant: 支援 Core ML 模型推理

# ondevice.supportsFoundation
source: Supports Apple Foundation Models
zh_hans: 支持 Apple Foundation Models
zh_hant: 支援 Apple Foundation Models

# ondevice.test
source: Test Inference
zh_hans: 测试推理
zh_hant: 测試推理

# ondevice.testGeneration
source: Test Text Generation
zh_hans: 测试文本生成
zh_hant: 测試文本生成

# ondevice.testPrompt
source: Enter test prompt
zh_hans: 输入测试提示词
zh_hant: 輸入测試提示词

# ondevice.title
source: Local Model
zh_hans: 本地大模型
zh_hant: 本地大模型

# ondevice.unavailable
source: On-device inference unavailable
zh_hans: 端侧推理不可用
zh_hant: 端侧推理不可用

# ondevice.unload
source: Unload
zh_hans: 卸载
zh_hant: 卸載

# prompt.default.actions
source: Action Suggestions
zh_hans: 行动建议
zh_hant: 行動建議

# prompt.default.expansion
source: Please perform a deep knowledge expansion on the following content. Requirements: 1. Supplement relevant historical background or scientific principles. 2. Provide in-depth analysis of at least 3 core details. 3. Explore potential connections with other fields or cutting-edge trends. 4. Maintain Markdown format, the first line must be '# <Expanded Title>'.
zh_hans: 请对以下内容进行深度知识扩充。 要求： 1. 补充相关的历史背景或科学原理。 2. 提供至少 3 个核心细节的深入解析。 3. 探讨该知识点与其他领域的潜在关联或前沿趋势。 4. 保持 Markdown 格式，首行必须是 '# <扩充后的标题>'。
zh_hant: 請對以下內容進行深度知識擴充。 要求： 1. 補充相關的历史背景或科學原理。 2. 提供至少 3 個核心細節的深入解析。 3. 探讨该知識点与其他領域的潛在關联或前沿趨勢。 4. 保持 Markdown 格式，首行必须是 '# <擴充後的標題>'。

# prompt.default.infographic
source: Generate a Mermaid flowchart...
zh_hans: 请根据提供的内容，生成一张逻辑严密的 Mermaid 可视化信息图 (Flowchart)。 要求： 1. 首行必须是 '# <总结标题>'（语言与内容一致）。 2. 第二行开始输出 Mermaid 代码，以 'graph TD' (或 LR/BT) 开头。 3. 节点定义必须使用 ID["文字内容"] 格式（严格使用双引号包裹文字）。 4. 文字内容中严禁包含任何引号、方括号、圆括号或冒号。 5. 重点展示知识点之间的因果、组成或流程关系。 6. 禁止使用 Markdown 代码块包裹（即禁止使用 ``` 符号）。
zh_hant: 請根據提供的內容，生成一張逻辑嚴密的 Mermaid 可視化資訊圖 (Flowchart)。 要求： 1. 首行必须是 '# <總結標題>'（語言与內容一致）。 2. 第二行開始輸出 Mermaid 程式碼，以 'graph TD' (或 LR/BT) 開頭。 3. 節点定义必须使用 ID["文字內容"] 格式（嚴格使用雙引號包裹文字）。 4. 文字內容中嚴禁包含任何引號、方括號、圓括號或冒號。 5. 重点展示知識点之間的因果、組成或流程關係。 6. 禁止使用 Markdown 程式碼塊包裹（即禁止使用 ``` 符號）。

# prompt.default.insightQuestions
source: Based on the following knowledge pages, generate 3 insightful questions that help the user explore deeper connections between concepts and discover knowledge gaps. Each question must be under 15 characters. Output ONLY a JSON array of 3 strings, no other text: ["question1", "question2", "question3"]
zh_hans: 根据以下知识页面，生成 3 个有洞察力的问题，帮助用户发现概念间的深层联系和知识盲区。 每个问题不超过 15 个字。 只输出 JSON 数组，不要其他文字：["问题1", "问题2", "问题3"]
zh_hant: 根據以下知識頁面，生成 3 個有洞察力的問題，說明使用者發現概念間的深层联係和知識盲區。 每個問題不超過 15 個字。 隻輸出 JSON 數組，不要其他文字：["問題1", "問題2", "問題3"]

# prompt.default.mindmap
source: Generate a Mermaid mindmap...
zh_hans: 请根据提供的内容，生成一个层级清晰的 Mermaid 思维导图 (Mindmap)。 要求： 1. 首行必须是 '# <总结标题>'（语言与内容一致）。 2. 以 'mindmap' 开头。 3. 根节点用 'root((标题))'。 4. 使用缩进表示层级，禁止使用 '-' 开头。 5. 节点文字禁止包含任何括号 '()'、冒号 ':' 或方括号 '[]'。 6. 禁止使用 Markdown 代码块包裹（即禁止使用 ``` 符号）。
zh_hant: 請根據提供的內容，生成一個层级清晰的 Mermaid 思維导圖 (Mindmap)。 要求： 1. 首行必须是 '# <總結標題>'（語言与內容一致）。 2. 以 'mindmap' 開頭。 3. 根節点用 'root((標題))'。 4. 使用縮進表示层级，禁止使用 '-' 開頭。 5. 節点文字禁止包含任何括號 '()'、冒號 ':' 或方括號 '[]'。 6. 禁止使用 Markdown 程式碼塊包裹（即禁止使用 ``` 符號）。
